#include "common.h"
#include "Nokia5110.h"
#include "MK60_port.h"
#include "MK60_gpio.h"
//#include "MK60_gpio.h"
//#include "MK60_gpio_cfg.h"


//*************************************************************************
//              LCDIO初始化
//*************************************************************************


void Lcd_IO_Init()
{
    gpio_init(PTB0,GPO,0);
    gpio_init(PTB1,GPO,0);
    gpio_init(PTB2,GPO,0);
    gpio_init(PTB3,GPO,0);
    gpio_init(PTE6,GPO,0);
    gpio_init(PTB5,GPO,0);
}


//*************************************************************************
//              LCD背光开关
//*************************************************************************

void Lcd_Led(char o )
{
    if(!!o)
    {
        LCD_Led = 1;
    }
    else
    {
        LCD_Led = 0;
    }
    
}

//*************************************************************************
//              LCD5110数据/命令写入
//*************************************************************************

void msgbox(char myData,char myCOMMON)
{
    char i;
    LCD_CE = 0;
    
    if(myCOMMON == 0)
      LCD_DC = 0;
    else
      LCD_DC = 1;
    
    for(i=0;i<8;i++)
    {
       // LCD_DN = (myData&0x80);
        
        
        if(myData&0x80)
          LCD_DN = 1;
        else
          LCD_DN = 0;
        
        myData = myData<<1;
        LCD_Clk = 0;
    //    DELAY_US(1);
        LCD_Clk = 1;
    }
    
    LCD_DC = 1;
    LCD_DN = 1;
    LCD_CE = 1;
    
}

//*************************************************************************
//              LCD5110初始化函数
//*************************************************************************

void Lcd_Init()
{
    LCD_Rst = 0;
    DELAY_US(250);
    LCD_Rst = 1;
    
    LCD_Rst = 1;
    LCD_CE = 1;
    LCD_DN = 1;
    LCD_DC = 1;
    LCD_Clk = 1;
    
    msgbox(0x21,0);
    DELAY_US(100);
    msgbox(0xc0,0);
    DELAY_US(100);
    msgbox(0x20,0);
    DELAY_US(100);
    msgbox(0x0c,0);
    DELAY_US(100);
       
}

//*************************************************************************
//              LCD5110坐标函数
//*************************************************************************

void Lcd_Goto(char x,char y)
{
    msgbox(0x40|y,0);//列
    msgbox(0x80|x,0);//行
}

//*************************************************************************
//              LCD5110清屏函数
//*************************************************************************

void Lcd_Cls()
{
    char i,j;
    Lcd_Goto(0,0);    //坐标归位
    for(i=6;i>0;i--)
    {
        for(j=84;j>0;j--)
        {
            msgbox(0x00,1);
        }
    }
}

//*************************************************************************
//              LCD5110黑屏函数
//*************************************************************************

void Lcd_Black()
{
    char i,j;
    Lcd_Goto(0,0);    //坐标归位
    for(i=6;i>0;i--)
    {
        for(j=84;j>0;j--)
        {
            msgbox(0xff,1);
        }
    }
}